Repository: Kurozora/kurozora-app
Catalog: Kurozora/Supporting Files/Content.xcstrings
Source language: en
Languages: ar, bn, cs, da, de, el, es, es_419, fa, fi, fil, fr, he, hi, hu, hy, id, it, ja, ko, ms, nb, nl, pl, pt_br, pt_pt, ro, ru, sv, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant

source: Kurozora does not guarantee all shows and mangas will be imported to your library. Once the request has been processed, a notification which contains the status of the import request will be sent. Furthermore, the uploaded file is deleted as soon as the import request has been processed. Selecting "overwrite" will replace your Kurozora library with the imported one from the file. Selecting "merge" will add missing items to your Kurozora library. If an item exists then the tracking information in your Kurozora library will be updated with the imported one from the file.
ar: لا تضمن Kurozora استيراد جميع العروض والمانجا إلى مكتبتك. بمجرد معالجة الطلب، سيُرسل إشعار يتضمن حالة طلب الاستيراد. علاوة على ذلك، يُحذف الملف المرفوع فور معالجة طلب الاستيراد. اختيار "الكتابة فوق" سيستبدل مكتبتك في Kurozora بالمكتبة المستوردة من الملف. اختيار "الدمج" سيضيف العناصر المفقودة إلى مكتبتك في Kurozora. وإذا كان العنصر موجوداً، فستُحدَّث معلومات التتبع في مكتبتك في Kurozora بالمعلومات المستوردة من الملف.
bn: Kurozora নিশ্চয়তা দেয় না যে সমস্ত শো ও manga আপনার লাইব্রেরিতে ইম্পোর্ট হবে। অনুরোধটি প্রক্রিয়া করা হলে, ইম্পোর্ট অনুরোধের অবস্থা সম্বলিত একটি নোটিফিকেশন পাঠানো হবে। এছাড়াও, ইম্পোর্ট অনুরোধটি প্রক্রিয়া করার সাথে সাথেই আপলোড করা ফাইলটি মুছে ফেলা হয়। "overwrite" নির্বাচন করলে আপনার Kurozora লাইব্রেরি ফাইল থেকে ইম্পোর্ট করা লাইব্রেরি দিয়ে প্রতিস্থাপিত হবে। "merge" নির্বাচন করলে অনুপস্থিত আইটেমগুলো আপনার Kurozora লাইব্রেরিতে যোগ হবে। যদি কোনো আইটেম ইতিমধ্যে থাকে, তবে আপনার Kurozora লাইব্রেরির ট্র্যাকিং তথ্য ফাইল থেকে ইম্পোর্ট করা তথ্য দিয়ে আপডেট হবে।
cs: Kurozora nezaručuje, že se do vaší knihovny naimportují všechny seriály a mangy. Jakmile bude požadavek zpracován, obdržíte oznámení obsahující stav požadavku na import. Nahraný soubor bude navíc smazán ihned po zpracování požadavku na import. Volba „přepsat“ nahradí vaši knihovnu Kurozora knihovnou naimportovanou ze souboru. Volba „sloučit“ přidá do vaší knihovny Kurozora chybějící položky. Pokud položka již existuje, budou informace o sledování ve vaší knihovně Kurozora aktualizovány podle naimportovaných ze souboru.
da: Kurozora garanterer ikke, at alle shows og manga bliver importeret til dit bibliotek. Når anmodningen er behandlet, sendes en notifikation, der indeholder status for importanmodningen. Desuden slettes den uploadede fil, så snart importanmodningen er behandlet. Vælger du "overskriv", erstattes dit Kurozora-bibliotek med det importerede fra filen. Vælger du "flet", tilføjes manglende elementer til dit Kurozora-bibliotek. Hvis et element allerede findes, opdateres sporingsoplysningerne i dit Kurozora-bibliotek med dem fra filen.
de: Kurozora übernimmt keine Garantie dafür, dass alle Serien und Mangas in Ihre Bibliothek importiert werden. Sobald die Anfrage bearbeitet wurde, wird eine Mitteilung mit dem Status der Importanfrage gesendet. Außerdem wird die hochgeladene Datei gelöscht, sobald die Importanfrage bearbeitet wurde. Mit der Auswahl von „Überschreiben“ wird Ihre Kurozora-Bibliothek durch die aus der Datei importierte ersetzt. Mit der Auswahl von „Zusammenführen“ werden fehlende Einträge zu Ihrer Kurozora-Bibliothek hinzugefügt. Falls ein Eintrag bereits vorhanden ist, werden die Tracking-Informationen in Ihrer Kurozora-Bibliothek mit denen aus der Datei aktualisiert.
el: Το Kurozora δεν εγγυάται ότι όλες οι σειρές και τα manga θα εισαχθούν στη βιβλιοθήκη σας. Μόλις ολοκληρωθεί η επεξεργασία του αιτήματος, θα σταλεί μια ειδοποίηση που θα περιέχει την κατάσταση του αιτήματος εισαγωγής. Επιπλέον, το αρχείο που μεταφορτώσατε διαγράφεται μόλις ολοκληρωθεί η επεξεργασία του αιτήματος εισαγωγής. Επιλέγοντας «αντικατάσταση» θα αντικαταστήσετε τη βιβλιοθήκη σας στο Kurozora με αυτή που εισάγεται από το αρχείο. Επιλέγοντας «συγχώνευση» θα προστεθούν τα στοιχεία που λείπουν στη βιβλιοθήκη σας στο Kurozora. Αν ένα στοιχείο υπάρχει ήδη, τότε οι πληροφορίες παρακολούθησης στη βιβλιοθήκη σας στο Kurozora θα ενημερωθούν με αυτές που εισάγονται από το αρχείο.
es: Kurozora no garantiza que todas las series y mangas se importen a su biblioteca. Una vez procesada la solicitud, se enviará una notificación con el estado de la solicitud de importación. Además, el archivo subido se elimina en cuanto se procesa la solicitud de importación. Seleccionar «sobrescribir» reemplazará su biblioteca de Kurozora por la importada desde el archivo. Seleccionar «combinar» añadirá los elementos que falten a su biblioteca de Kurozora. Si un elemento ya existe, la información de seguimiento de su biblioteca de Kurozora se actualizará con la importada desde el archivo.
es_419: Kurozora no garantiza que todos los shows y mangas se importen a tu biblioteca. Una vez procesada la solicitud, se enviará una notificación con el estado de la solicitud de importación. Además, el archivo subido se elimina en cuanto se procesa la solicitud de importación. Seleccionar "sobrescribir" reemplazará tu biblioteca de Kurozora con la importada desde el archivo. Seleccionar "combinar" agregará los elementos faltantes a tu biblioteca de Kurozora. Si un elemento ya existe, la información de seguimiento de tu biblioteca de Kurozora se actualizará con la importada desde el archivo.
fa: Kurozora تضمین نمی‌کند که همهٔ نمایش‌ها و manga ها به کتابخانهٔ شما وارد شوند. پس از پردازش درخواست، اعلانی حاوی وضعیت درخواست وارد کردن ارسال خواهد شد. همچنین، فایل بارگذاری‌شده به‌محض پردازش درخواست وارد کردن حذف می‌شود. انتخاب «بازنویسی» کتابخانهٔ Kurozora شما را با کتابخانهٔ واردشده از فایل جایگزین می‌کند. انتخاب «ادغام» موارد ناموجود را به کتابخانهٔ Kurozora شما اضافه می‌کند. اگر موردی از پیش موجود باشد، اطلاعات پیگیری در کتابخانهٔ Kurozora شما با اطلاعات واردشده از فایل به‌روزرسانی خواهد شد.
fi: Kurozora ei takaa, että kaikki sarjat ja mangat tuodaan kirjastoosi. Kun pyyntö on käsitelty, lähetetään ilmoitus, joka sisältää tuontipyynnön tilan. Lisäksi ladattu tiedosto poistetaan heti, kun tuontipyyntö on käsitelty. "Korvaa"-valinta korvaa Kurozora-kirjastosi tiedostosta tuodulla kirjastolla. "Yhdistä"-valinta lisää puuttuvat kohteet Kurozora-kirjastoosi. Jos kohde on jo olemassa, Kurozora-kirjastosi seurantatiedot päivitetään tiedostosta tuoduilla tiedoilla.
fil: Hindi ginagarantiya ng Kurozora na lahat ng shows at manga ay mai-import sa inyong library. Kapag naproseso na ang kahilingan, magpapadala ng abiso na naglalaman ng katayuan ng kahilingan sa pag-import. Bukod pa rito, buburahin ang na-upload na file sa sandaling maproseso ang kahilingan sa pag-import. Kapag pinili ang "overwrite", papalitan ang inyong Kurozora library ng na-import mula sa file. Kapag pinili ang "merge", idaragdag ang mga nawawalang item sa inyong Kurozora library. Kung mayroon nang item, mapapalitan ang impormasyon sa pagsubaybay sa inyong Kurozora library ng na-import mula sa file.
fr: Kurozora ne garantit pas que tous les shows et mangas seront importés dans votre bibliothèque. Une fois la demande traitée, une notification contenant le statut de la demande d'importation sera envoyée. De plus, le fichier téléversé est supprimé dès que la demande d'importation a été traitée. Choisir « écraser » remplacera votre bibliothèque Kurozora par celle importée depuis le fichier. Choisir « fusionner » ajoutera les éléments manquants à votre bibliothèque Kurozora. Si un élément existe déjà, ses informations de suivi dans votre bibliothèque Kurozora seront mises à jour avec celles importées depuis le fichier.
he: Kurozora אינה מתחייבת שכל התכנים והמנגות ייובאו לספרייה שלך. לאחר עיבוד הבקשה, תישלח התראה המכילה את סטטוס בקשת הייבוא. בנוסף, הקובץ שהועלה יימחק מיד עם סיום עיבוד בקשת הייבוא. בחירה ב"החלפה" תחליף את ספריית Kurozora שלך בזו שיובאה מהקובץ. בחירה ב"מיזוג" תוסיף פריטים חסרים לספריית Kurozora שלך. אם פריט כבר קיים, פרטי המעקב בספריית Kurozora שלך יעודכנו לפי אלה שיובאו מהקובץ.
hi: Kurozora इस बात की गारंटी नहीं देता कि सभी shows और mangas आपकी लाइब्रेरी में इम्पोर्ट हो जाएँगे। अनुरोध संसाधित हो जाने के बाद, एक सूचना भेजी जाएगी जिसमें इम्पोर्ट अनुरोध की स्थिति होगी। इसके अलावा, इम्पोर्ट अनुरोध संसाधित होते ही अपलोड की गई फ़ाइल हटा दी जाती है। "overwrite" चुनने पर आपकी Kurozora लाइब्रेरी फ़ाइल से इम्पोर्ट की गई लाइब्रेरी से बदल दी जाएगी। "merge" चुनने पर आपकी Kurozora लाइब्रेरी में अनुपस्थित आइटम जोड़ दिए जाएँगे। यदि कोई आइटम पहले से मौजूद है, तो आपकी Kurozora लाइब्रेरी में उसकी ट्रैकिंग जानकारी फ़ाइल से इम्पोर्ट की गई जानकारी से अपडेट कर दी जाएगी।
hu: A Kurozora nem garantálja, hogy minden műsor és manga importálásra kerül a könyvtáradba. A kérés feldolgozása után értesítést küldünk, amely tartalmazza az importálási kérés állapotát. Ezenkívül a feltöltött fájl törlésre kerül, amint az importálási kérés feldolgozása befejeződött. A „felülírás” kiválasztásával a Kurozora könyvtárad a fájlból importálttal lesz lecserélve. Az „egyesítés” kiválasztásával a hiányzó elemek hozzáadódnak a Kurozora könyvtáradhoz. Ha egy elem már létezik, akkor a Kurozora könyvtáradban lévő követési információ frissül a fájlból importálttal.
hy: Kurozora-ն չի երաշխավորում, որ բոլոր ցուցադրությունները և manga-ները կներմուծվեն Ձեր գրադարան։ Հարցումը մշակվելուց հետո Ձեզ կուղարկվի ծանուցում, որը կպարունակի ներմուծման հարցման կարգավիճակը։ Ավելին, վերբեռնված ֆայլը ջնջվում է անմիջապես այն բանից հետո, երբ ներմուծման հարցումը մշակվում է։ «overwrite» ընտրելը Ձեր Kurozora գրադարանը կփոխարինի ֆայլից ներմուծվածով։ «merge» ընտրելը Ձեր Kurozora գրադարանին կավելացնի բացակայող տարրերը։ Եթե տարրն արդեն գոյություն ունի, ապա Ձեր Kurozora գրադարանի հետևման տվյալները կթարմացվեն ֆայլից ներմուծվածով։
id: Kurozora tidak menjamin semua tayangan dan manga akan diimpor ke pustaka Anda. Setelah permintaan diproses, notifikasi yang berisi status permintaan impor akan dikirim. Selain itu, berkas yang diunggah akan dihapus segera setelah permintaan impor diproses. Memilih "timpa" akan mengganti pustaka Kurozora Anda dengan pustaka hasil impor dari berkas. Memilih "gabungkan" akan menambahkan item yang belum ada ke pustaka Kurozora Anda. Jika sebuah item sudah ada, informasi pelacakan di pustaka Kurozora Anda akan diperbarui dengan yang diimpor dari berkas.
it: Kurozora non garantisce che tutte le serie e i manga verranno importati nella tua libreria. Una volta elaborata la richiesta, verrà inviata una notifica contenente lo stato della richiesta di importazione. Inoltre, il file caricato viene eliminato non appena la richiesta di importazione è stata elaborata. Selezionando "sovrascrivi" sostituirai la tua libreria Kurozora con quella importata dal file. Selezionando "unisci" aggiungerai gli elementi mancanti alla tua libreria Kurozora. Se un elemento esiste già, le informazioni di monitoraggio nella tua libreria Kurozora verranno aggiornate con quelle importate dal file.
ja: すべての作品や manga がライブラリにインポートされることを Kurozora は保証いたしません。リクエストの処理が完了すると、インポートリクエストの状況をお知らせする通知が送信されます。また、アップロードされたファイルは、インポートリクエストの処理が完了し次第削除されます。 「上書き」を選択すると、Kurozora のライブラリがファイルからインポートされた内容に置き換えられます。 「結合」を選択すると、不足している項目が Kurozora のライブラリに追加されます。すでに項目が存在する場合は、Kurozora ライブラリの追跡情報がファイルからインポートされた内容で更新されます。
ko: Kurozora는 모든 작품과 manga가 라이브러리로 가져와지는 것을 보장하지 않습니다. 요청이 처리되면 가져오기 요청의 상태가 담긴 알림이 전송됩니다. 또한 업로드된 파일은 가져오기 요청이 처리되는 즉시 삭제됩니다. "덮어쓰기"를 선택하면 Kurozora 라이브러리가 파일에서 가져온 라이브러리로 대체됩니다. "병합"을 선택하면 누락된 항목이 Kurozora 라이브러리에 추가됩니다. 항목이 이미 존재하는 경우 Kurozora 라이브러리의 추적 정보가 파일에서 가져온 정보로 업데이트됩니다.
ms: Kurozora tidak menjamin bahawa semua siri dan manga akan diimport ke pustaka anda. Setelah permintaan diproses, satu pemberitahuan yang mengandungi status permintaan import akan dihantar. Selain itu, fail yang dimuat naik akan dipadam sebaik sahaja permintaan import selesai diproses. Memilih "tulis ganti" akan menggantikan pustaka Kurozora anda dengan pustaka yang diimport daripada fail. Memilih "gabung" akan menambah item yang tiada ke pustaka Kurozora anda. Jika sesuatu item sudah wujud, maklumat penjejakan dalam pustaka Kurozora anda akan dikemas kini dengan yang diimport daripada fail.
nb: Kurozora garanterer ikke at alle serier og mangaer vil bli importert til biblioteket ditt. Når forespørselen er behandlet, sendes det et varsel som inneholder statusen for importforespørselen. Den opplastede filen slettes så snart importforespørselen er behandlet. Velger du «overskriv», erstattes Kurozora-biblioteket ditt med det importerte fra filen. Velger du «slå sammen», legges manglende elementer til i Kurozora-biblioteket ditt. Hvis et element allerede finnes, oppdateres sporingsinformasjonen i Kurozora-biblioteket ditt med den importerte fra filen.
nl: Kurozora garandeert niet dat alle series en manga's naar je bibliotheek worden geïmporteerd. Zodra het verzoek is verwerkt, wordt er een melding verstuurd met de status van het importverzoek. Daarnaast wordt het geüploade bestand verwijderd zodra het importverzoek is verwerkt. Met 'overschrijven' vervang je je Kurozora-bibliotheek door de geïmporteerde bibliotheek uit het bestand. Met 'samenvoegen' voeg je ontbrekende items toe aan je Kurozora-bibliotheek. Als een item al bestaat, wordt de trackinginformatie in je Kurozora-bibliotheek bijgewerkt met die uit het bestand.
pl: Kurozora nie gwarantuje, że wszystkie tytuły i mangi zostaną zaimportowane do Twojej biblioteki. Po przetworzeniu żądania zostanie wysłane powiadomienie zawierające status żądania importu. Ponadto przesłany plik zostaje usunięty natychmiast po przetworzeniu żądania importu. Wybranie opcji „nadpisz” zastąpi Twoją bibliotekę Kurozora tą zaimportowaną z pliku. Wybranie opcji „scal” doda brakujące pozycje do Twojej biblioteki Kurozora. Jeśli pozycja już istnieje, informacje o śledzeniu w Twojej bibliotece Kurozora zostaną zaktualizowane na podstawie tych z pliku.
pt_br: A Kurozora não garante que todos os shows e mangas serão importados para a sua biblioteca. Assim que a solicitação for processada, será enviada uma notificação contendo o status da solicitação de importação. Além disso, o arquivo enviado é excluído assim que a solicitação de importação for processada. Selecionar "sobrescrever" substituirá a sua biblioteca da Kurozora pela importada do arquivo. Selecionar "mesclar" adicionará os itens ausentes à sua biblioteca da Kurozora. Se um item já existir, as informações de acompanhamento na sua biblioteca da Kurozora serão atualizadas com as do arquivo.
pt_pt: O Kurozora não garante que todas as séries e mangas sejam importadas para a sua biblioteca. Assim que o pedido for processado, será enviada uma notificação com o estado do pedido de importação. Além disso, o ficheiro carregado é eliminado logo que o pedido de importação for processado. Ao selecionar "substituir", a sua biblioteca do Kurozora será substituída pela importada a partir do ficheiro. Ao selecionar "unir", os itens em falta serão adicionados à sua biblioteca do Kurozora. Se um item já existir, as informações de acompanhamento na sua biblioteca do Kurozora serão atualizadas com as do ficheiro.
ro: Kurozora nu garantează că toate serialele și manga vor fi importate în biblioteca dumneavoastră. După procesarea cererii, veți primi o notificare care conține starea cererii de import. De asemenea, fișierul încărcat este șters imediat ce cererea de import a fost procesată. Selectând „suprascrie”, biblioteca dumneavoastră Kurozora va fi înlocuită cu cea importată din fișier. Selectând „îmbină”, elementele lipsă vor fi adăugate în biblioteca dumneavoastră Kurozora. Dacă un element există deja, informațiile de urmărire din biblioteca dumneavoastră Kurozora vor fi actualizate cu cele importate din fișier.
ru: Kurozora не гарантирует, что все тайтлы и manga будут импортированы в вашу библиотеку. После обработки запроса вам будет отправлено уведомление со статусом импорта. Кроме того, загруженный файл удаляется сразу после обработки запроса на импорт. Выбор «перезаписать» заменит вашу библиотеку Kurozora на импортированную из файла. Выбор «объединить» добавит недостающие элементы в вашу библиотеку Kurozora. Если элемент уже существует, информация о его отслеживании в вашей библиотеке Kurozora будет обновлена импортированными данными из файла.
sv: Kurozora garanterar inte att alla serier och mangor importeras till ditt bibliotek. När begäran har behandlats skickas en avisering som innehåller statusen för importbegäran. Vidare raderas den uppladdade filen så snart importbegäran har behandlats. Om du väljer "skriv över" ersätts ditt Kurozora-bibliotek med det importerade från filen. Om du väljer "sammanfoga" läggs saknade objekt till i ditt Kurozora-bibliotek. Om ett objekt redan finns uppdateras spårningsinformationen i ditt Kurozora-bibliotek med den importerade från filen.
ta: எல்லா shows மற்றும் mangas உங்கள் library-க்கு இறக்குமதி செய்யப்படும் என்பதற்கு Kurozora உத்தரவாதம் அளிக்கவில்லை. கோரிக்கை செயலாக்கப்பட்டவுடன், இறக்குமதி கோரிக்கையின் நிலையைக் கொண்ட ஓர் அறிவிப்பு அனுப்பப்படும். மேலும், இறக்குமதி கோரிக்கை செயலாக்கப்பட்டவுடன் பதிவேற்றப்பட்ட கோப்பு நீக்கப்படும். "overwrite" என்பதைத் தேர்ந்தெடுத்தால் உங்கள் Kurozora library, கோப்பிலிருந்து இறக்குமதி செய்யப்பட்டதால் மாற்றப்படும். "merge" என்பதைத் தேர்ந்தெடுத்தால் இல்லாத உருப்படிகள் உங்கள் Kurozora library-க்குச் சேர்க்கப்படும். ஒரு உருப்படி ஏற்கனவே இருந்தால், உங்கள் Kurozora library-யில் உள்ள கண்காணிப்புத் தகவல் கோப்பிலிருந்து இறக்குமதி செய்யப்பட்டதால் புதுப்பிக்கப்படும்.
te: అన్ని షోలు మరియు mangaలు మీ లైబ్రరీలోకి దిగుమతి అవుతాయని Kurozora హామీ ఇవ్వదు. అభ్యర్థన ప్రాసెస్ అయిన తర్వాత, దిగుమతి అభ్యర్థన స్థితిని కలిగి ఉన్న నోటిఫికేషన్ పంపబడుతుంది. అంతేకాకుండా, దిగుమతి అభ్యర్థన ప్రాసెస్ అయిన వెంటనే అప్‌లోడ్ చేసిన ఫైల్ తొలగించబడుతుంది. "overwrite" ఎంచుకుంటే మీ Kurozora లైబ్రరీ ఫైల్ నుండి దిగుమతి చేసిన దానితో భర్తీ చేయబడుతుంది. "merge" ఎంచుకుంటే మీ Kurozora లైబ్రరీకి లేని అంశాలు జోడించబడతాయి. ఒక అంశం ఇప్పటికే ఉంటే, మీ Kurozora లైబ్రరీలోని ట్రాకింగ్ సమాచారం ఫైల్ నుండి దిగుమతి చేసిన దానితో నవీకరించబడుతుంది.
th: Kurozora ไม่รับประกันว่ารายการและ manga ทั้งหมดจะถูกนำเข้าสู่คลังของคุณ เมื่อดำเนินการตามคำขอเสร็จสิ้น ระบบจะส่งการแจ้งเตือนที่ระบุสถานะของคำขอนำเข้าให้ทราบ นอกจากนี้ ไฟล์ที่อัปโหลดจะถูกลบทันทีที่ดำเนินการตามคำขอนำเข้าเสร็จสิ้น การเลือก "เขียนทับ" จะแทนที่คลัง Kurozora ของคุณด้วยข้อมูลที่นำเข้าจากไฟล์ การเลือก "ผสาน" จะเพิ่มรายการที่ขาดหายไปลงในคลัง Kurozora ของคุณ หากมีรายการอยู่แล้ว ข้อมูลการติดตามในคลัง Kurozora ของคุณจะได้รับการอัปเดตด้วยข้อมูลที่นำเข้าจากไฟล์
tr: Kurozora, tüm yapımların ve mangaların kütüphanenize aktarılacağını garanti etmez. İstek işlendikten sonra, içe aktarma isteğinin durumunu içeren bir bildirim gönderilecektir. Ayrıca, yüklenen dosya, içe aktarma isteği işlenir işlenmez silinir. "Üzerine yaz" seçeneğini belirlemek, Kurozora kütüphanenizi dosyadan içe aktarılan kütüphaneyle değiştirir. "Birleştir" seçeneğini belirlemek, eksik ögeleri Kurozora kütüphanenize ekler. Bir öge zaten mevcutsa, Kurozora kütüphanenizdeki takip bilgileri dosyadan içe aktarılanla güncellenir.
uk: Kurozora не гарантує, що всі шоу та manga буде імпортовано до вашої бібліотеки. Після обробки запиту вам надішлеться сповіщення зі статусом запиту на імпорт. Крім того, завантажений файл видаляється одразу після обробки запиту на імпорт. Вибір варіанта «перезаписати» замінить вашу бібліотеку Kurozora імпортованою з файлу. Вибір варіанта «об’єднати» додасть відсутні елементи до вашої бібліотеки Kurozora. Якщо елемент уже існує, дані відстеження у вашій бібліотеці Kurozora буде оновлено імпортованими з файлу.
ur: Kurozora اس بات کی ضمانت نہیں دیتا کہ تمام shows اور mangas آپ کی لائبریری میں درآمد ہو جائیں گے۔ درخواست پر کارروائی مکمل ہونے کے بعد ایک اطلاع بھیجی جائے گی جس میں درآمد کی درخواست کی حالت درج ہوگی۔ مزید برآں، اپ لوڈ کردہ فائل درآمد کی درخواست پر کارروائی مکمل ہوتے ہی حذف کر دی جائے گی۔ "overwrite" منتخب کرنے سے آپ کی Kurozora لائبریری فائل سے درآمد شدہ لائبریری سے بدل دی جائے گی۔ "merge" منتخب کرنے سے غائب اشیاء آپ کی Kurozora لائبریری میں شامل کر دی جائیں گی۔ اگر کوئی شے پہلے سے موجود ہو تو آپ کی Kurozora لائبریری میں اس کی ٹریکنگ معلومات فائل سے درآمد شدہ معلومات سے اپ ڈیٹ کر دی جائیں گی۔
vi: Kurozora không bảo đảm rằng tất cả các show và manga sẽ được nhập vào thư viện của bạn. Sau khi yêu cầu được xử lý, một thông báo chứa trạng thái của yêu cầu nhập sẽ được gửi đến. Ngoài ra, tập tin đã tải lên sẽ bị xóa ngay khi yêu cầu nhập được xử lý xong. Chọn "ghi đè" sẽ thay thế thư viện Kurozora của bạn bằng thư viện được nhập từ tập tin. Chọn "hợp nhất" sẽ thêm các mục còn thiếu vào thư viện Kurozora của bạn. Nếu một mục đã tồn tại thì thông tin theo dõi trong thư viện Kurozora của bạn sẽ được cập nhật theo thông tin được nhập từ tập tin.
zh_hans: Kurozora 无法保证所有作品和 manga 都会被导入您的资料库。请求处理完成后，系统将发送一条包含导入请求状态的通知。此外，上传的文件将在导入请求处理完成后立即删除。 选择「覆盖」会用文件中导入的资料库替换您的 Kurozora 资料库。 选择「合并」会将缺失的项目添加到您的 Kurozora 资料库中。若某项目已存在，则您 Kurozora 资料库中的追踪信息将被文件中导入的信息更新。
zh_hant: Kurozora 無法保證所有作品與 manga 都會匯入您的書庫。請求處理完成後，系統將傳送一則包含匯入請求狀態的通知。此外，上傳的檔案會在匯入請求處理完成後立即刪除。 選擇「覆寫」會以檔案中匯入的書庫取代您的 Kurozora 書庫。 選擇「合併」會將缺少的項目加入您的 Kurozora 書庫。若項目已存在，您 Kurozora 書庫中的追蹤資訊將以檔案中匯入的資訊更新。
